[
  {
    "agent": "installer_electrical_contractor",
    "run_date": "2026-02-26",
    "top_constraints": [
      {
        "constraint": "Article 726→722 renumbering in the 2026 NEC creates dual-article permit friction: jurisdictions on 2020 or 2023 NEC will reject permit applications citing Article 722, while those adopting the 2026 edition may not recognize Article 726 references still in manufacturer documentation.",
        "why_now": "The 2026 NEC is beginning to be adopted by some AHJs while the majority remain on 2023 or 2020, opening a transition window where the article number on bid documents can determine permit acceptance or rejection.",
        "who_feels_it": "Electrical contractors submitting Class 4 permits in multi-jurisdiction projects; estimators who must reference different code editions in a single bid package.",
        "implication_for_design": "Bid documents and permit applications should cite both Article 726 (2023 NEC) and Article 722 (2026 NEC) with edition years noted until the 2026 edition achieves majority adoption. Manufacturers should update product cut sheets accordingly.",
        "levers": ["L5", "L1"],
        "supporting_items": ["23", "36"],
        "confidence": "High"
      }
    ],
    "tensions": [
      {
        "tension": "Speed of deployment vs. inspection certainty — contractors want to deploy Class 4 in jurisdictions on older NEC editions, but AHJs unfamiliar with the Class 4 safety model may issue holds regardless of which article number is cited.",
        "why_it_matters": "A single AHJ hold on a Class 4 installation delays all subsequent work and creates a local precedent that other inspectors in the same jurisdiction may follow for years.",
        "levers": ["L5", "L7"],
        "supporting_items": ["23", "36"]
      }
    ],
    "hypotheses": [
      {
        "hypothesis": "In jurisdictions that have not adopted the 2026 NEC, AHJs are more likely to require supplemental documentation (e.g., an NFPA interpretation letter or local amendment) before approving Class 4 permit applications.",
        "what_would_change_my_mind": "Evidence of Class 4 permits being approved routinely in 2020-NEC jurisdictions without supplemental documentation, within normal permit review timelines.",
        "supporting_items": ["23"]
      }
    ],
    "original_angles": [
      {
        "working_title": "Article 722 vs. 726: A Contractor's Checklist for the 2026 NEC Code Transition",
        "thesis": "Contractors installing Class 4 systems must now verify which NEC edition governs their jurisdiction and adjust permit documents accordingly — a new pre-bid step that affects scope, schedule, and AHJ communication strategy.",
        "outline": [
          "H1: What changed — Article 726 to Article 722 renumbering, and what stayed the same",
          "H2: How to identify which NEC edition your AHJ is enforcing",
          "H3: Permit application language that covers both editions",
          "H4: When to escalate and how to request an informal pre-permit meeting"
        ],
        "must_cite_items": ["23", "36"],
        "missing_evidence_to_find": [
          "State-by-state NEC 2026 adoption timeline and effective dates",
          "Sample permit language approved by an AHJ in a 2026-NEC jurisdiction"
        ]
      }
    ],
    "questions_for_owner": [
      "Has VoltServer or FMP Alliance published updated specification language that references both Article 726 and Article 722 for the transition period?",
      "Are there documented cases of AHJ holds on Class 4 permits due to article number confusion, and how were they resolved?"
    ]
  },
  {
    "agent": "owner_operator_facilities",
    "run_date": "2026-02-26",
    "top_constraints": [
      {
        "constraint": "AI rack densities averaging 27 kW (AFCOM) exceed the UPS and PDU ampacity assumptions baked into most enterprise data center infrastructure refreshes, meaning approved AI hardware budgets implicitly require unbudgeted facilities upgrades.",
        "failure_mode": "Facilities managers approve AI hardware deployments on a capital plan that excludes corresponding UPS module and distribution upgrades — the upgrade cost surfaces as an emergency capex request post-deployment, creating schedule and operational disruption.",
        "operational_burden": "Unplanned infrastructure upgrades during live operations require extended maintenance windows, coordination with UPS vendors and utilities, and potential rack density throttling that limits AI cluster performance until upgrades complete.",
        "what_buyers_will_require_next": "Pre-purchase infrastructure audits for AI hardware that validate UPS, PDU, and cooling headroom before purchase orders are approved; organizational policies that route AI hardware procurement through facilities review.",
        "levers": ["L3", "L4"],
        "supporting_items": ["41", "49"],
        "confidence": "High"
      }
    ],
    "tensions": [
      {
        "tension": "Centralize vs. distribute power — centralized UPS minimizes redundancy cost but creates single-point-of-failure exposure and distribution losses at 27+ kW per rack; distributed UPS modules reduce risk but add per-rack cost and maintenance overhead.",
        "tradeoff": "A centralized N+1 UPS plant is lower capex and simpler to maintain at low densities but becomes a throughput bottleneck as average rack density climbs. Distributed lithium-ion modules at the row or rack level are more resilient but significantly higher per-kW capex.",
        "who_wins_who_loses": "Large hyperscale operators can absorb distributed architecture costs through scale. Mid-market enterprise data centers face the worst trade-off — too small to benefit from modular redundancy economics, too large to ignore the density problem.",
        "levers": ["L3", "L9"],
        "supporting_items": ["41", "49"]
      }
    ],
    "hypotheses": [
      {
        "hypothesis": "Mid-market enterprise data centers with current average rack densities below 10 kW are approving AI workload expansions that will push average density above 20 kW within 24 months, triggering UPS and distribution upgrades that were not included in the 5-year capital plan.",
        "measurement_or_metric": "Track average rack density quarterly against UPS and PDU ampacity headroom; flag when headroom falls below 20% of rated capacity.",
        "supporting_items": ["41"]
      }
    ],
    "original_angles": [
      {
        "working_title": "The 27 kW Budget Blind Spot: What Facilities Managers Must Check Before Approving AI Hardware",
        "thesis": "When IT buys AI servers, facilities inherits the infrastructure upgrade bill. At 27 kW average rack density and rising, existing UPS and PDU assumptions break — but facilities managers are rarely in the AI hardware approval loop.",
        "outline": [
          "H1: How AFCOM's 27 kW average translates to specific UPS and PDU requirements",
          "H2: The three infrastructure limits most commonly exceeded in AI deployments",
          "H3: A facilities review checklist for AI hardware purchase approvals"
        ],
        "must_cite_items": ["41", "49"],
        "missing_evidence_to_find": [
          "Documented case study of a facilities budget conflict triggered by an AI hardware deployment",
          "Cost range for UPS and distribution upgrades required to support a 10-rack AI cluster at 27 kW average"
        ]
      }
    ],
    "questions_for_owner": [
      "Does VoltServer have data center or colocation case studies that quantify distribution cost savings at 20+ kW average rack density?",
      "What is the typical facilities vs. IT budget ownership split for power infrastructure in a mid-size enterprise data center?"
    ]
  },
  {
    "agent": "compliance_ahj",
    "run_date": "2026-02-26",
    "top_constraints": [
      {
        "constraint": "AHJs enforcing 2020 or 2023 NEC have no codified article for Class 4 systems — Article 726 may be unknown to the plan reviewer, requiring contractors to educate inspectors at the permit window rather than in formal pre-construction meetings.",
        "what_ahj_cares_about": "AHJs are primarily concerned with inspector safety and liability documentation: an unfamiliar wiring system that claims to be safe because it limits fault current requires filing documentation that the inspector can defend if questioned.",
        "documentation_gap": "Most Class 4 permit applications lack a concise one-page AHJ-facing summary mapping the specific safety claim (current limiting) to a UL listing and an NEC article, forcing inspectors to reconstruct this from product cut sheets and NFPA documents.",
        "how_to_de-risk": "Develop a standard AHJ documentation package: safety model summary, UL listing numbers, applicable NEC article (citing both 726 and 722 with edition years), and a contact at the FMP Alliance or NFPA available to answer inspector questions directly.",
        "levers": ["L7", "L6", "L5"],
        "supporting_items": ["23", "36"],
        "confidence": "High"
      }
    ],
    "tensions": [
      {
        "tension": "Innovation speed vs. inspection certainty — new product listings and updated article numbers arrive faster than inspector training and code adoption cycles.",
        "why_it_matters": "Each AHJ that issues an informal hold on a Class 4 installation creates a local precedent that slows subsequent installs in that jurisdiction. First-install friction shapes inspector behavior for years.",
        "levers": ["L7", "L6"],
        "supporting_items": ["23", "36"]
      }
    ],
    "hypotheses": [
      {
        "hypothesis": "AHJs in jurisdictions that have not participated in formal Class 4 familiarization sessions (with FMP Alliance or NFPA) are significantly more likely to issue RFIs or informal holds on Class 4 permit applications.",
        "what_evidence_would_support_it": "Comparison of permit approval timelines across jurisdictions with and without documented Class 4 AHJ outreach; installer survey data on permit friction and hold frequency by jurisdiction.",
        "supporting_items": ["23"]
      }
    ],
    "original_angles": [
      {
        "working_title": "What AHJs Need to See: Class 4 Permit Documentation in the 2026 NEC Transition",
        "thesis": "The compliance bottleneck for Class 4 is not the safety model — it is AHJ familiarity. A standardized documentation package that maps safety claims to UL listings and code references reduces holds and builds the inspector confidence needed for widespread adoption.",
        "outline": [
          "H1: What information AHJs need and typically do not receive in Class 4 permit packages",
          "H2: How the Article 726→722 renumbering creates documentation confusion for inspectors on older code editions",
          "H3: A template AHJ documentation package for Class 4 installations"
        ],
        "must_cite_items": ["23", "36"],
        "missing_evidence_to_find": [
          "Survey data on AHJ permit approval times for Class 4 vs. traditional wiring in the same jurisdiction",
          "List of jurisdictions with completed FMP Alliance or NFPA AHJ outreach sessions"
        ]
      }
    ],
    "questions_for_owner": [
      "Has VoltServer or FMP Alliance developed a standard AHJ documentation package that can be distributed to inspectors before a permit application is submitted?",
      "Which jurisdictions have the most active Class 4 permit volume and which have the highest hold or RFI rates?"
    ]
  },
  {
    "agent": "mep_system_designer",
    "run_date": "2026-02-26",
    "top_constraints": [
      {
        "constraint": "27 kW average rack density (AFCOM) pushes standard PDU ampacity and busway sizing past their useful range for AI cluster provisioning — a 10-rack AI cluster at 27 kW average requires ~130A per rack, not the 40–60A circuits in most current MEP specifications.",
        "design_assumption_under_pressure": "MEP engineers have specified 20–30 kVA per rack as the high-density exception for AI rows; AFCOM's 27 kW average (not peak) means the median AI rack now exceeds the high-density spec, shifting the specification baseline upward industry-wide.",
        "architecture_shift": "Power distribution to AI clusters must move from branch-circuit PDUs to overhead busway with tap-off boxes or rack-mounted 3-phase PDUs fed from 100A+ circuits — requiring wider containment aisles, different switchgear, and revised cable tray routing.",
        "downstream_effects": "UPS module sizing changes (larger modules or higher per-row count), generator step-loading during UPS bypass, coolant distribution scaling (liquid cooling at 27 kW requires CDU placement within 15 feet of rack), and code-compliant fault protection at higher ampacity.",
        "levers": ["L9", "L2", "L1"],
        "supporting_items": ["41", "49"],
        "confidence": "High"
      }
    ],
    "tensions": [
      {
        "tension": "Density vs. pathways — higher rack power density requires larger conductors and closer UPS/transformer placement, which conflicts with existing containment geometry and coolant distribution routing.",
        "design_tradeoff": "Overhead busway allows higher ampacity without conduit congestion but requires structural ceiling loading assessment and limits future reconfiguration. Bottom-fed conduit maintains layout flexibility but creates pathway congestion at the ampacity levels required for 27 kW clusters.",
        "levers": ["L1", "L2", "L9"],
        "supporting_items": ["41", "49"]
      }
    ],
    "hypotheses": [
      {
        "hypothesis": "Standard 40A rack PDUs are undersized for 27 kW average rack density — 60A or 100A 3-phase circuits are increasingly required as the baseline specification for AI-dedicated rows, not as a high-density exception.",
        "design_decision_it_affects": "PDU ampacity specification, busway sizing, UPS output breaker sizing, and cable routing strategy in AI-dedicated rows.",
        "supporting_items": ["41"]
      }
    ],
    "original_angles": [
      {
        "working_title": "Power Distribution Spec Assumptions That Break at 27 kW AI Rack Density",
        "thesis": "MEP engineers who have not updated their AI-row specification assumptions since 2022 are under-specifying PDUs, busway, and UPS capacity. At 27 kW average (per AFCOM), the old high-density exception is now the median case.",
        "outline": [
          "H1: What 27 kW average actually means for PDU, busway, and UPS sizing calculations",
          "H2: Three specification assumptions that require immediate revision for AI workloads",
          "H3: How Class 4 power distribution changes the wiring method options for high-density rows"
        ],
        "must_cite_items": ["41", "49"],
        "missing_evidence_to_find": [
          "Published MEP specification for a delivered AI cluster at 25+ kW average rack density",
          "Cost comparison: overhead busway vs. bottom-fed conduit at 100A per rack"
        ]
      }
    ],
    "questions_for_owner": [
      "Does VoltServer have specifications or case studies for Class 4 power distribution in high-density (20+ kW) data center rows?",
      "What is the maximum ampacity that has been deployed in a single Class 4 circuit in a data center environment?"
    ]
  },
  {
    "agent": "finance_roi_skeptic",
    "run_date": "2026-02-26",
    "top_constraints": [
      {
        "constraint": "California's residential electricity rates — among the highest in the country — undermine the operating-cost ROI of heat pumps versus gas furnaces in the state that has mandated 6 million heat pump installations by 2030.",
        "who_pays": "Building owners and tenants — the incremental operating cost of switching from gas to electric heat is borne by the occupant or passed through in rent; the state captures the decarbonization benefit while the owner bears the cost.",
        "who_benefits": "Heat pump manufacturers, electrical contractors (panel upgrades), and the state's decarbonization goals — but not necessarily the building owner whose energy bill increases relative to gas.",
        "what_metric_matters": "Simple payback period on heat pump installation including electrical upgrade costs, versus gas, at current California electricity rates: in markets above $0.35/kWh, payback typically exceeds 10 years without incentives.",
        "levers": ["L2", "L8", "L4"],
        "supporting_items": ["38", "25"],
        "confidence": "High"
      }
    ],
    "tensions": [
      {
        "tension": "CapEx commitment vs. uncertain OpEx return — upfront heat pump cost plus electrical panel upgrade is a capital event; high electricity rates shift the operating-cost comparison unfavorably, reducing building owner willingness to commit capex without guaranteed payback.",
        "economic_tradeoff": "A building owner who spends $15,000–$30,000 on electrical upgrades faces operating costs that may be higher than the gas system replaced, unless incentive payments, time-of-use rate structures, or fixed-charge reforms change the electricity cost curve materially.",
        "levers": ["L2", "L4"],
        "supporting_items": ["38", "25"]
      }
    ],
    "hypotheses": [
      {
        "hypothesis": "In California markets with electricity rates above $0.35/kWh, the heat pump payback period versus gas exceeds 10 years for the average building owner without incentives, making the unaided economic case insufficient for adoption at the scale required by state policy.",
        "data_needed": "Published utility rate schedules and heat pump operating cost models for major California utilities (PG&E, SCE, SDG&E) at 2025–2026 rates, compared side-by-side with gas operating costs by climate zone.",
        "supporting_items": ["38", "25"]
      }
    ],
    "original_angles": [
      {
        "working_title": "The California Heat Pump Math Problem: Why Policy Goals and Economics Are Pointing in Opposite Directions",
        "thesis": "California's 6M heat pump target depends on an economic case that does not currently work at scale in the state's own electricity rate environment. Without incentive reform or rate restructuring, adoption will remain concentrated in incentive-eligible projects.",
        "outline": [
          "H1: The operating cost math — heat pump vs. gas at California's 2025–2026 electricity rates",
          "H2: What the 6M target requires in terms of annual installation rate and electrical upgrade throughput",
          "H3: Where the economics do work — incentive-stacked projects and low-rate utility territories"
        ],
        "must_cite_items": ["38", "25"],
        "missing_evidence_to_find": [
          "Published heat pump operating cost model at PG&E and SCE 2025–2026 rates by climate zone",
          "Breakdown of California heat pump installations by incentive type and utility territory"
        ]
      }
    ],
    "questions_for_owner": [
      "Does VoltServer have a quantified electrical upgrade cost model for California multifamily heat pump retrofits that could be compared against the operating cost break-even?",
      "Are there California utility territories where heat pump operating economics are currently positive vs. gas, making them priority markets for DE-enabled retrofits?"
    ]
  }
]
